# 2. Выполнить логические побитовые операции "И", "ИЛИ" и др.
# над числами 5 и 6. Выполнить
# над числом 5 побитовый сдвиг вправо и влево на два знака.

NUM_A = 5 # 101
NUM_B = 6 # 110
print(f"И = {NUM_A & NUM_B} <<0b101 и 0b110 = 0b100>>")
print(f"ИЛИ = {NUM_A | NUM_B} <<0b101 и 0b110 = 0b111>>")
print(f"ИСКЛ. И = {NUM_A ^ NUM_B} <<0b101 и 0b110 = 0b011>>")
print(f"ОТРИЦ. = {~NUM_A} <<не 101 = -0b110>>")
print(f"СДВИГ ВЛЕВО НА 2 = {NUM_A << 2} <<влево 0b101 = 0b10100>>")
print(f"СДВИГ ВПРАВО НА 2 = {NUM_A >> 2} <<вправо 0b101 = 0b001>>")



