#5.	В массиве найти максимальный отрицательный элемент.
# Вывести на экран его значение и позицию (индекс) в массиве.
lst = [1, 3, -15, 8, 3, 2, 7, 3, -8, 4, 1, 2, 7, 9, -3, 3, ]
print(min(lst), lst.index(min(lst)))

